# StructuralSectionLProfile Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionLProfile Class
Members See Also
---
Defines parameters for L profile structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionLProfile : StructuralSectionGeneralLA
```

Visual Basic
---
```text
Public Class StructuralSectionLProfile _
	Inherits StructuralSectionGeneralLA
```

Visual C++
---
```text
public ref class StructuralSectionLProfile : public StructuralSectionGeneralLA
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralLA Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionLProfile
# See Also
StructuralSectionLProfile Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace